#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
terraform
module.jenkins.data.aws_ami.amazon_linux_2_arm: Reading...
module.jenkins.data.aws_availability_zones.available: Reading...
module.jenkins.aws_key_pair.jenkins: Refreshing state... [id=jenkins-key]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02176cc2b17f10ac5]
module.vpc.data.aws_availability_zones.available: Reading...
aws_s3_bucket.state: Refreshing state... [id=cloud-infra-terraform-state-bucket]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
module.jenkins.data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
module.jenkins.data.aws_ami.amazon_linux_2_arm: Read complete after 1s [id=ami-06aaef1e7c0d81331]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0499d32a8a226e86e]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d2c50d4f02ce26e0]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06b610272e2b34b4e]
module.jenkins.aws_security_group.jenkins_sg: Refreshing state... [id=sg-0331187cc7f84949e]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9c9cfeb60422ac0]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-022b77f673c445d3f]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-082172c48cbc5ab4f]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a43c693759d3cf49]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0787e134f4aa8d918]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c067046be802feb1]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-037de9d5c17ca3808]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0d4c8014d9bc83a50]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-090360aa4ce73813e]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0eb25619823d1aa49]
module.jenkins.aws_instance.jenkins: Refreshing state... [id=i-0db5134e5e5ae7e9a]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a43c693759d3cf491080289494]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09782fe43aeb61090]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0994ec98753d4e0c8]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-082306372813bdc6b]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-073eedd1fefb3384b]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-041557b84bbde764b]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0d4a6795edb688037]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0787e134f4aa8d9181080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-022b77f673c445d3f1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.jenkins.aws_ebs_volume.jenkins_data will be created
  + resource "aws_ebs_volume" "jenkins_data" {
      + arn               = (known after apply)
      + availability_zone = "eu-central-1a"
      + create_time       = (known after apply)
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + region            = "eu-central-1"
      + size              = 20
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "jenkins-data"
          + "Project"     = "cloud-infra"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "jenkins-data"
          + "Project"     = "cloud-infra"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.jenkins.aws_volume_attachment.jenkins_data will be created
  + resource "aws_volume_attachment" "jenkins_data" {
      + device_name = "/dev/sdf"
      + id          = (known after apply)
      + instance_id = "i-0db5134e5e5ae7e9a"
      + region      = "eu-central-1"
      + volume_id   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Artyom-K-Dev, Action: `pull_request`*